ExtendedFlatPlate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    zeroGradient
    {
        type            patch;
        nFaces          220;
        startFace       11020;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       11240;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       11280;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11200;
        startFace       11380;
    }
)

// ************************************************************************* //
