ExtendedFlatPlate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)  // 0
    (1 0 0)  // 1
    (1 1 0)   // 2
    (0 1 0)   // 3
    (0 0 0.1) // 4
    (1 0 0.1)  // 5
    (1 1 0.1)  // 6
    (0 1 0.1)  // 7
    (5 0 0)  // 8
    (5 1 0)  // 9
    (5 0 0.1) // 10
    (5 1 0.1) // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (0.05 20 1)
    hex (1 8 9 2 5 10 11 6) (100 40 1) simpleGrading (100 20 1)
);

edges
(
);

boundary
(
    zeroGradient
    {
        type patch;
        faces
        (
            (3 7 6 2)
	    (0 1 5 4)
	    (2 6 11 9)
	    (8 9 11 10)
        );
    }
    
    inlet
    {
    	type patch;
	faces
	(
	   (0 4 7 3)
	);
    }


    fixedWalls
    {
        type wall;
        faces
        (
            (1 8 10 5)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
	    (1 2 9 8)
	    (5 10 11 6)
	    
	);
    }
);


// ************************************************************************* //
